       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO3.
      * Comment: This is a stub designed to test the JCL

       ENVIRONMENT DIVISION.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PARTSUPP-FILE ASSIGN TO PARTSUPP.

       DATA DIVISION.

       FILE SECTION.
       FD  PARTSUPP-FILE
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 473 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS CLAIMS-BUFFER.
       01  CLAIMS-BUFFER      PIC X(473).


       WORKING-STORAGE SECTION.

       COPY PARTSUPP.



       PROCEDURE DIVISION.
           OPEN INPUT PARTSUPP-FILE

           READ PARTSUPP-FILE INTO PART-SUPP-ADDR-PO

           CALL 'PARTEDIT'
           CALL 'SUPPEDIT'
           CALL 'ADDREDIT'
           CALL 'POEDIT'
           GOBACK.