//RTPOT49S JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=(,4),REGION=0M,COND=(16,LT)
//       EXEC PGM=IEFBR14
//DINPUT  DD DSN=&SYSUID..EXAM.PARTSUPP.IN,DISP=(OLD,DELETE)
//DINPUT  DD DSN=&SYSUID..EXAM.UNITESTS.SORTED,DISP=(OLD,DELETE)
//DOUTPUT  DD DSN=&SYSUID..PARTMAIN.GOOD.OUT,DISP=(OLD,DELETE)
//DERROR   DD DSN=&SYSUID..PARTMAIN.ERROR.OUT,DISP=(OLD,DELETE)
//DPARTS   DD DSN=&SYSUID..PARTMAIN.PARTS.OUT,DISP=(OLD,DELETE)
//DSUPPS   DD DSN=&SYSUID..PARTMAIN.SUPLIERS.OUT,DISP=(OLD,DELETE)
//DADDRS DD DSN=&SYSUID..PARTMAIN.ADRESSES.OUT,DISP=(OLD,DELETE)
//DPO    DD DSN=&SYSUID..PARTMAIN.PURCHRDS.OUT,DISP=(OLD,DELETE)
