//RTPOT49S JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=(,4),REGION=0M,COND=(16,LT)
//SORTSTEP EXEC PGM=SORT
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SORTIN   DD  DSN=RTPOT49.EXAM.UNITESTS,DISP=SHR
//SORTOUT DD DSN=RTPOT49.EXAM.UNITESTS.SORTED,
//             DISP=(NEW,CATLG,DELETE),
//            STORCLAS=USRBASE,SPACE=(TRK,(5,5),RLSE),
//            DCB=(LRECL=1006,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSIN DD *
  SORT FIELDS=(1,23,CH,A)
